hananddong/ble_uwb_code/UWB_BLE_nrf52832/components/proprietary_rf/gzll/nrf_gzll.h
/**< Transmission CRC failure callback function definition */
typedef void (*nrf_gzll_crc_failure_callback)(uint32_t pipe, uint8_t rf_channel);


#if defined(NRF52_SERIES) || defined(__SDK_DOXYGEN__)
/**
    @brief Data structure holding external front
          end control configuration.
*/
typedef struct
{
    bool             pa_enabled;                                     ///< Flag indicating if PA control is enabled.
    bool             pa_active_high;                                 ///< Flag indicating if PA is active in high input state.
    uint8_t          pa_gpio_pin;                                    ///< Number of output pin used for PA control.
    uint8_t          pa_gpiote_channel;                              ///< Number of GPIOTE channel used for PA control.
    bool             lna_enabled;                                    ///< Flag indicating if LNA control is enabled.
    bool             lna_active_high;                                ///< Flag indicating if LNA is active in high input state.
    uint8_t          lna_gpio_pin;                                   ///< Number of output pin used for LNA control.
    uint8_t          lna_gpiote_channel;                             ///< Number of GPIOTE channel used for LNA control.
    NRF_TIMER_Type *timer;                                           ///< Pointer to the TIMER instance.
    uint8_t          ppi_channels[NRF_GZLL_PA_LNA_PPI_CHANNELS_NUM]; ///< PPI channels used to control front end.
    uint8_t
    ramp_up_time;                                   ///< Determines how early should the PA/LNA be turned one before RADIO activity. Should be less than @ref NRF_GZLL_PA_LNA_MAX_RAMP_UP_TIME.
} nrf_gzll_pa_lna_cfg_t;
#endif

/******************************************************************************/
/** @name General API functions
    @{ */
/******************************************************************************/

/**
    @brief Initialize Gazell.

    @param mode The mode to initialize Gazell in.

    @retval true if Gazell initialized.
    @retval false if Gazell failed to initialize.
*/
bool nrf_gzll_init(nrf_gzll_mode_t mode);

/**
    @brief Enable Gazell.

    When enabled the behaviour described for the current Gazell Link Layer mode
    will apply.

    @retval false if nrf_gzll_init has not previously been called or invalid address
                 has been set - see Anomaly 107 at nRF52832 errata document.
*/
bool nrf_gzll_enable(void);

/**
    @brief Disable Gazell.

    When calling this function the Gazell Link Layer will begin disabling,
    and will be fully disabled when Gazell calls nrf_gzll_disabled().
    If there are any pending notifications, or if any new notifications are
    being added to the internal notification queue while Gazell is disabling,
    these will be sent to the application before Gazell is fully disabled.

    After Gazell has been fully disabled, no more notifications will be sent to
    the application.
*/
void nrf_gzll_disable(void);

/** Check whether Gazell is enabled or disabled.

    @retval true  If Gazell is enabled.
    @retval false If Gazell is disabled.
*/
bool nrf_gzll_is_enabled(void);

/** @} */

/******************************************************************************/
/** @name Device mode callback functions
    @{ */
/******************************************************************************/

/**
    @brief ACK received callback (Device mode only).

    This callback is made when the Device receives an ACK (acknowledgement)
    packet.
    @sa nrf_gzll_ack_payload_received.

    @param pipe is the pipe on which an ACK packet was received.
    @param tx_info struct used to indicate whether a payload was received in the
    ack, as well as the number of TX attempts and channel switches required.
*/
void nrf_gzll_device_tx_success(uint32_t pipe, nrf_gzll_device_tx_info_t tx_info);

/**
    @brief Transmission failed callback (Device mode only).

    This callback is made when a packet does not receive an ACK after
    nrf_gzll_max_retries is reached. The packet is deleted by Gazell.

    @param pipe is the pipe on which the transmission failed.
    @param tx_info struct used to indicate whether a payload was received
    in the ack, as well as RSSI and the number of TX attempts and
    channel switches required.
*/
void nrf_gzll_device_tx_failed(uint32_t pipe, nrf_gzll_device_tx_info_t tx_info);

/** @} */

/******************************************************************************/
/** @name Host mode callback functions
    @{ */
/******************************************************************************/

/**
    @brief Data packet received callback (Host mode only).

    This callback is made when a Host receives a data packet from a Device.

    @param pipe is the pipe on which the data packet was received.
    @param rx_info struct used to indicate whether a payload was removed from the
    pipe's TX FIFO, as well as RSSI.
*/
void nrf_gzll_host_rx_data_ready(uint32_t pipe, nrf_gzll_host_rx_info_t rx_info);

/** @} */

/******************************************************************************/
/** @name Callback functions for both Device and Host mode
    @{ */
/******************************************************************************/

/**
    @brief Disabled callback.

    This is called after Gazell enters the disabled state.
    There is no further CPU use by Gazell, the radio is disabled and the timer is
    powered down.
*/
void nrf_gzll_disabled(void);

/**
    @brief Mode changed callbackl.

    This function is called after the Gazell mode has been changed.
    This function can only be called when Gazell is enabled.
*/
void nrf_gzll_mode_changed(void);

/** @} */

/******************************************************************************/
/** @name Packet transmission and receiving functions
    @{ */
/******************************************************************************/

/**
    @brief Add a packet to the tail of the TX FIFO.

    In Device mode, the packet will be added.
    In Host mode, the payload will be piggybacked onto an ACK.

