hananddong/ble_uwb_code/UWB_BLE_nrf52832/components/proprietary_rf/gzll/nrf_gzll.h
    @param pipe      Pipe to which to add the payload. This value must be < NRF_GZLL_CONST_PIPE_COUNT.
    @param p_payload Pointer to the payload.
    @param length    Number of bytes of the payload to transmit
                    (0 to NRF_GZLL_CONST_MAX_PAYLOAD_LENGTH).

    @retval true  if the packet was successfully added to the TX FIFO.
    @retval false if unsuccessful, check nrf_gzll_error_code_t for more information.
*/
bool nrf_gzll_add_packet_to_tx_fifo(uint32_t pipe, uint8_t *p_payload, uint32_t length);

/**
    @brief Fetch a packet from the head of the RX FIFO.

    @param pipe      Pipe from which to fetch the payload. This value must be < NRF_GZLL_CONST_PIPE_COUNT.
    @param p_payload Pointer to copy the payload to.
    @param p_length  Length must be at least as large as the the number of bytes
                    in the received payload length.

    @retval true  If the fetch was successful.
    @retval false If unsuccessful, check nrf_gzll_error_code_t for more information.
*/
bool nrf_gzll_fetch_packet_from_rx_fifo(uint32_t pipe, uint8_t *p_payload, uint32_t *p_length);

/**
    @brief Get the number of packets in the TX FIFO on a specific pipe.

    @param pipe The pipe for which to check. This value must be < NRF_GZLL_CONST_PIPE_COUNT.

    @retval >=0 The number of packets in the TX FIFO for the pipe.
    @retval -1  If the pipe number is invalid.
*/
int32_t nrf_gzll_get_tx_fifo_packet_count(uint32_t pipe);

/**
    @brief Get the number of packets in the RX FIFO on a specific pipe.

    @param pipe  The pipe for which to check. This value must be < NRF_GZLL_CONST_PIPE_COUNT.
    @retval >=0  The number of packets in the RX FIFO for the pipe.
    @retval -1   If the pipe number is invalid.
*/
int32_t nrf_gzll_get_rx_fifo_packet_count(uint32_t pipe);

/**
    @brief Get the total number of packets residing in all TX and RX FIFOs.

    Can be used to check against NRF_GZLL_CONST_MAX_TOTAL_PACKETS to
    determine if there is free space in the memory pool for more packets.

    @return The number of packets residing in all TX and RX FIFOs.
*/
uint32_t nrf_gzll_get_total_allocated_packet_count(void);

/**
    @brief Check if adding a packet to a pipe's TX FIFO should be successful.

    Checks if there is another space in the pipe's TX and RX FIFOs
    as well as enough overall space in the packet pool.

    @param pipe The pip for which to check. This value must be < NRF_GZLL_CONST_PIPE_COUNT.

    @retval true  If there is another space.
    @retval false If there is not enough space, or the pipe is invalid.
*/
bool nrf_gzll_ok_to_add_packet_to_tx_fifo(uint32_t pipe);

/**
    @brief Flush the RX FIFO for a specific pipe.

    Delete all the packets and free the memory of the TX FIFO for a
    specific pipe.

    Note that it is not allowed to flush a TX FIFO when
    Gazell is enabled.

    @param pipe is the pipe for which to flush. This value must be < NRF_GZLL_CONST_PIPE_COUNT.
    @retval true if the pipe was flushed.
    @retval false if the pipe was not flushed.
*/
bool nrf_gzll_flush_tx_fifo(uint32_t pipe);

/**
    @brief Flush the RX FIFO for a specific pipe.

    Delete all the packets and free the memory of the RX FIFO for a
    specific pipe.

    @param pipe is the pipe for which to flush. This value must be < NRF_GZLL_CONST_PIPE_COUNT.
    @retval true if the pipe was flushed.
    @retval false if the pipe was not flushed.
*/
bool nrf_gzll_flush_rx_fifo(uint32_t pipe);

/**
    @brief Function for enabling transmission statistics.

    @param p_statistics Pointer to the statistics structure.

    @return True if channel statistics has been enabled, false otherwise.
*/
bool nrf_gzll_tx_statistics_enable(nrf_gzll_tx_statistics_t *p_statistics);

/**
    @brief Function for disabling transmission statistics.
*/
void nrf_gzll_tx_statistics_disable(void);

/**
    @brief Function for obtaining number of transmission timeouts for specific channel.

    @param[in]  channel_index Channel index in channel table.
    @param[out] p_timeouts    Pointer for the result.

    @return True in case of success, false otherwise.
*/
bool nrf_gzll_get_channel_timeouts(uint8_t channel_index, uint32_t *p_timeouts);

/**
    @brief Function for clearing transmission statistic structure.
*/
void nrf_gzll_reset_tx_statistics(void);

/** @} */

/******************************************************************************/
/** @name Configuration functions

    Configuration 'set' functions may only be called while Gazell is disabled. The
    new parameter comes into effect when Gazell is enabled again.

    Configuration 'get' functions may be called at any time.

    @{ */
/******************************************************************************/

/**
    @brief Function for registering callback to be called on the transmission timeout.
*/
void nrf_gzll_tx_timeout_callback_register(nrf_gzll_tx_timeout_callback callback);


/**
    @brief Function for registering callback to be called on the packet CRC failure.
*/
void nrf_gzll_crc_failure_callback_register(nrf_gzll_crc_failure_callback callback);


/**
    @brief Set the mode.

    @param mode The mode to be used.
               See nrf_gzll_mode_t for a list of valid modes.

    It is allowed to change mode when Gazell is enabled. If the mode is
    being changed while Gazell is enabled, the mode will not change right away.
    In this case the callback function nrf_gzll_mode_changed() will be called
    after the mdoe has changed.

    @retval true  If the parameter was set.
*/
bool nrf_gzll_set_mode(nrf_gzll_mode_t mode);

/**
    @brief Get function counterpart to nrf_gzll_set_mode().

    @return The current mode.
*/
nrf_gzll_mode_t nrf_gzll_get_mode(void);

/**
    @brief Set the base address for pipe 0.

    The full on-air address for each pipe is composed of a multi-byte base address
    prepended to a prefix byte.

    For packets to be received correctly, the most significant byte of
    the base address should not be an alternating sequence of 0s and 1s i.e.
    it should not be 0x55 or 0xAA.

    @param base_address The 4 byte base address. All bytes are used.

    @note Due to the nRF52 Anomaly 107, pipe 0 address should not have
         both prefix and two LSB of base address set to 0.

    @retval true  If the parameter was set.
    @return false If Gazell was enabled.
*/
bool nrf_gzll_set_base_address_0(uint32_t base_address);

/**
    @brief Get function counterpart to nrf_gzll_set_base_address_0().

    @return Base address 0.
*/
uint32_t nrf_gzll_get_base_address_0(void);

/**
    @brief Set the base address for pipes 1-7.

    Pipes 1 through 7 share base_address_1. @sa nrf_gzll_set_base_address_0.

