hananddong/ble_uwb_code/UWB_BLE_nrf52832/components/proprietary_rf/gzll/nrf_gzll.h
    @param base_address The 4 byte base address.

    @retval true  If the parameter was set.
    @retval false If Gazell was enabled.
*/
bool nrf_gzll_set_base_address_1(uint32_t base_address);

/**
    @brief Get function counterpart to nrf_gzll_set_base_address_1().

    @return Base address 1.
*/
uint32_t nrf_gzll_get_base_address_1(void);

/**
    @brief Set the address prefix byte for a specific pipe.

    Each pipe should have its own unique prefix byte.

    @param pipe                The pipe that the address should apply to.
                              This value must be < NRF_GZLL_CONST_PIPE_COUNT.
    @param address_prefix_byte The address prefix byte.

    @note Due to the Anomaly 107, pipe 0 address should not have
         both prefix and two LSB of base address set to 0.

    @retval true  If the parameter was set.
    @retval false If Gazell was enabled, or if the pipe was invalid.
*/
bool nrf_gzll_set_address_prefix_byte(uint32_t pipe, uint8_t address_prefix_byte);

/**
    @brief Get function counterpart to nrf_gzll_set_address_prefix_byte().

    @param pipe                      The pipe for which to get the address.
                                    This value must be < NRF_GZLL_CONST_PIPE_COUNT.
    @param p_out_address_prefix_byte The pointer in which to return the
                                    address prefix byte.

    @retval true If the parameter was returned.
    @retval false If Gazell was enabled, the pipe was invalid or
                 out_address was a NULL pointer.
*/
bool nrf_gzll_get_address_prefix_byte(uint32_t pipe, uint8_t *p_out_address_prefix_byte);

/**
    @brief Set which pipes shall listen for packets in Host mode.

    This value is a bitmap, and each bit corresponds to a given pipe number.
    Bit 0 set to "1" enables pipes 0, bit 1 set to "1" enables pipe 1
    and so forth.
    The maximum number of pipes is defined by NRF_GZLL_CONST_PIPE_COUNT.

    @param pipes A bitmap specifying which pipes to monitor.

    @retval true  If the parameter was set.
    @retval false If Gazell was enabled.
*/
bool nrf_gzll_set_rx_pipes_enabled(uint32_t pipes);

/**
    @brief Get function counterpart to nrf_gzll_set_rx_pipes_enabled().

    @return Bitmap holding the current enabled pipes.
*/
uint32_t nrf_gzll_get_rx_pipes_enabled(void);

/**
    @brief Set the timeslot period.

    The length in microseconds of a Gazell link layer timeslot.

    The minimum value of the timeslot period is dependent of the
    radio data rate (@sa nrf_gzll_set_datarate()).

    - For NRF_GZLL_DATARATE_2MBIT the timeslot period must be >= 600 us.
    - For NRF_GZLL_DATARATE_1MBIT the timeslot period must be >= 900 us.
    - For NRF_GZLL_DATARATE_250KBIT the timeslot period must be >= 2700 us.

    @param period_us The timeslot period in microseconds.

    @retval true  If the parameter was set.
    @retval false If Gazell was enabled.
*/
bool nrf_gzll_set_timeslot_period(uint32_t period_us);

/**
    @brief Get function counterpart to nrf_gzll_get_timeslot_period().

    @return The current timeslot period.
*/
uint32_t nrf_gzll_get_timeslot_period(void);

/**
    @brief Set the Device channel selection policy

    The policy determines the initial channel when starting a new packet.
    transmission.

    @param policy The channel selection policy.

    @arg NRF_GZLL_DEVICE_CHANNEL_SELECTION_POLICY_USE_SUCCESSFUL specifies
    that a new packet transmission always shall use the previous
    successful channel from the channel table. If Gazell is "in sync", Gazell
    will wait until this channel is being monitored by the Host before starting
    the transmission.

    @arg NRF_GZLL_DEVICE_CHANNEL_SELECTION_POLICY_USE_CURRENT specifies that
    Gazell shall transmit on the channel that is currently being monitored by the
    Host. This parameter is only used when Gazell is "in sync". When "out of" sync,
    Gazell will always start using the "previous successful" channel.

    @retval true  If the parameter was set.
    @retval false If Gazell was enabled or the policy was invalid.
*/
bool nrf_gzll_set_device_channel_selection_policy(nrf_gzll_device_channel_selection_policy_t policy);

/**
    @brief Get function counterpart to nrf_gzll_set_device_channel_selection_policy().

    @return the Device channel selection policy.
*/
nrf_gzll_device_channel_selection_policy_t nrf_gzll_get_device_channel_selection_policy(void);

/**
    @brief Set the number of timeslots that Gazell shall
    reside on a single channel before switching to another channel.

    This parameter applies in Host mode and for a Device that is
    in the "in sync" state.

    Since the Device and Host can not be in perfect synchronization, a
    transmission should overlap to adjacent timeslots on the Host.
    Therefore this value should be at least 2.

    @sa nrf_gzll_set_timeslots_per_channel_when_device_out_of_sync

    @param timeslots The number of timeslots to reside on
    each channel before channel switch.

    @retval true  If the parameter was set.
    @retval false If Gazell was enabled.
*/
bool nrf_gzll_set_timeslots_per_channel(uint32_t timeslots);

/**
    @brief Get function counterpart to nrf_gzll_set_timeslots_per_channel().

    @return The current number of timeslots.
*/
uint32_t nrf_gzll_get_timeslots_per_channel(void);

/**
    @brief Set the number of timeslots that a Gazell shall
    reside on a single channel before switching to another channel when
    in the "out of sync" state.

    This value should be set so that the Device transmits on one channel
    while the Host goes through a full channel rotation, i.e.,
    channel_table_size*timeslots_per_channel.
    This ensures that the channels on the Device and Host will coincide
    at some point.
    Further increasing the value has been observed to provide better performance
    in the presence of interferers.

    @param timeslots The number of timeslots to reside on
    each channel before channel switch.

    @retval true  If the parameter was set.
    @retval false If Gazell was enabled.
*/
bool nrf_gzll_set_timeslots_per_channel_when_device_out_of_sync(uint32_t timeslots);

/**
    @brief Get function counterpart to
    nrf_gzll_set_timeslots_per_channel_when_device_out_of_sync().

    @return The current number of timeslots.
*/
uint32_t nrf_gzll_get_timeslots_per_channel_when_device_out_of_sync(void);

/**
    @brief Set the number of timeslots after a successful
    reception of a Device or Host packet that the Gazell Link Layer shall assume
    that the link is synchronized. A value of 0 implies that the
    link is always out of sync.

    @param lifetime The sync lifetime in number of timeslots.

    @retval true  If the sync lifetime was set.
    @retval false If Gazell was enabled.
*/
bool nrf_gzll_set_sync_lifetime(uint32_t lifetime);

/**
    @brief Get function counterpart to nrf_gzll_set_sync_lifetime().

