hananddong/ble_uwb_code/UWB_BLE_nrf52832/components/proprietary_rf/gzll/nrf_gzll.h
    @return The sync lifetime measured in number of timeslots.
*/
uint32_t nrf_gzll_get_sync_lifetime(void);

/**
    @brief Set the maximum number of TX attempts
    that can be used for a single packet.

    After the maximum number of attempts have been spent without
    receiving any ACK from the Host, the transmission will be terminated
    and the nrf_gzll_device_tx_failed() callback will be called. A zero
    value of the function parameter implies the infinite number of TX attempts.

    @param max_tx_attempts The maximum number of TX attempts.
*/
void nrf_gzll_set_max_tx_attempts(uint16_t max_tx_attempts);

/**
    @brief Get function counterpart to nrf_gzll_set_max_tx_attempts().

    @return The current max Device TX attempts.
*/
uint16_t nrf_gzll_get_max_tx_attempts(void);

/**
    @brief Set the table of Radio Frequency (RF) channels.

    The valid channels are in the range 0 <= channel <= 125, where the
    actual centre frequency is (2400 + channel) MHz.
    The maximum channel table size is defined by
    NRF_GZLL_CONST_MAX_CHANNEL_TABLE_SIZE.

    @param p_channel_table Pointer to the channel table.
    @param size            The size of the channel table.

    @retval true  If the channel table was set.
    @retval false If Gazell was enabled, or the channel_table pointer was NULL,
                 or the size was invalid.
*/
bool nrf_gzll_set_channel_table(uint8_t *p_channel_table, uint32_t size);

/**
    @brief Get the table of Radio Frequency (RF) channels.

    @param p_channel_table Pointer to copy the channel table to.
    @param p_size          Pointer to copy the size of the channel table to.
                          The value already at size must be at least the size
                          of the channel table.

    @retval true  If the channel table was copied to channel_table.
    @retval false If the channel_table pointer was NULL,
                 or the size was not large enough.
*/
bool nrf_gzll_get_channel_table(uint8_t *p_channel_table, uint32_t *p_size);

/**
    @brief Get the current channel table size.

    @return The current channel table size.
*/
uint32_t nrf_gzll_get_channel_table_size(void);

/**
    @brief Set the radio TX power.

    @param tx_power TX power.

    @retval true  If the parameter was set.
    @retval false If the TX power was invalid.
*/
bool nrf_gzll_set_tx_power(nrf_gzll_tx_power_t tx_power);

/**
    @brief Get function counterpart to nrf_gzll_set_tx_power().

    @return The current TX power.
*/
nrf_gzll_tx_power_t nrf_gzll_get_tx_power(void);

/**
    @brief Set the radio datarate.

    @param data_rate Datarate.

    @retval true  If the parameter was set.
    @retval false If Gazell was enabled or the datarate was invalid.
*/
bool nrf_gzll_set_datarate(nrf_gzll_datarate_t data_rate);

/**
    @brief Get function counterpart to nrf_gzll_set_datarate().

    @return The current datarate.
*/
nrf_gzll_datarate_t nrf_gzll_get_datarate(void);

/**
    @brief Set whether start/stop of external oscillator (XOSC) shall be handled
    automatically inside Gazell or manually by the application.

    When controlling the XOSC manually from the application it is
    required that the XOSC is started before Gazell is enabled.

    When start/stop of the XOSC is handled automatically by Gazell,
    the XOSC will only be running when needed, that is when the radio
    is being used or when Gazell needs to maintain synchronization.

    It is required that the XOSC is started in order for the radio to be
    able to send or receive any packets.

    @param xosc_ctl setting for XOSC control.

    @retval true  if the parameter was set.
    @retval false if Gazell was enabled or the xosc_ctl value was invalid.
*/
bool nrf_gzll_set_xosc_ctl(nrf_gzll_xosc_ctl_t xosc_ctl);

/**
    Get function counterpart for nrf_gzll_set_xosc_ctl();

    @return The XOSC control setting.
*/
nrf_gzll_xosc_ctl_t nrf_gzll_get_xosc_ctl(void);

/**
    @brief Set Gazell to disable automatically after a certain number of timeslot ticks.

    @param num_ticks Number of timeslot ticks.

*/
void nrf_gzll_set_auto_disable(uint32_t num_ticks);

#if defined(NRF52_SERIES) || defined(__SDK_DOXYGEN__)
/**
    @brief Set up external front end control.

    @param p_pa_lna_cfg Pointer to the configuration struct.
*/
bool nrf_gzll_set_pa_lna_cfg(nrf_gzll_pa_lna_cfg_t const *p_pa_lna_cfg);
#endif

/**
    @brief Get the number of timeslot ticks that have occurred since
          nrf_gzll_init() was called.

    @return Number of timeslot ticks.

*/
uint32_t nrf_gzll_get_tick_count(void);

/**
    @brief Clear the internal timeslot tick count variable that is read
    by nrf_gzll_get_tick_count().

*/
void nrf_gzll_clear_tick_count(void);

/** @} */

/******************************************************************************/
/** @name Error handling functions
    @{ */
/******************************************************************************/

/**
    @brief Gets the Gazell error code.

    @return The current error code.
*/
nrf_gzll_error_code_t nrf_gzll_get_error_code(void);


/**
    @brief Reset the Gazell error code.

    The error code is reset to NRF_GZLL_ERROR_CODE_NO_ERRROR.
*/
void nrf_gzll_reset_error_code(void);

/** @} */

/** @} */

#ifdef __cplusplus
}
#endif

#endif
